upstream/OpenFOAM-v2606/tutorials/mesh/blockMesh/pipe/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    "(U|k|epsilon|omega|f|v2)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    residualControl
    {
        p               1e-2;
        U               1e-3;
        "(k|epsilon|omega|f|v2)" 1e-3;
    }
}

relaxationFactors
{
    equations
    {
        //- Constant relaxation factor
        //U               0.9; // 0.9 is more stable but 0.95 more convergent

        //- Control relaxation factor through time-based table
        //U               table
        //(
        //    (0  0.7)
        //    (100 0.95)
        //);

        //- Control relaxation factor through registered variable
        //- (type uniformDimensionedScalarField) controlled by functionObject
        U               lookup;
        name            banana;

        ".*"            0.95; // 0.9 is more stable but 0.95 more convergent
    }
}


// ************************************************************************* //
